src/InformationRegisters/ОстаткиПоРазмещению/ОстаткиПоРазмещению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОстаткиПоРазмещению</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПриблизительно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Размещение</name>
    <type>
      <types>CatalogRef.Размещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОстаткиПоРазмещению/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Номенклатура") Тогда
		Запись.Номенклатура	= Параметры.Номенклатура;
		Запись.ДатаСобытия	= ТекущаяДатаСеанса();
		Запись.Количество	= 1;
	КонецЕсли;
	
КонецПроцедуры
